# Dependencies
tap "homebrew/core"
tap "homebrew/cask"
tap "oven-sh/bun"
brew "mas"
brew "stow"

# Browsers
cask "google-chrome"
cask "firefox"

# Communication
cask "slack"
cask "zoom"

# Design
cask "figma"
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161

# Developer
brew "bun"
brew "deno"
brew "fish"
brew "git"
brew "openssh"
brew "rbenv"
brew "watchman"
cask "android-studio"
cask "flipper"
cask "graphql-playground"
cask "hyper"
cask "postman"
cask "visual-studio-code"
mas "Xcode", id: 497799835

# Entertainment
cask "spotify"
cask "steam"

# Productivity
cask "1password"
cask "notion"

# Utilities
brew "imagemagick"
mas "NordVPN", id: 905953485
