# Dependencies
tap "homebrew/bundle"
tap "mobile-dev-inc/tap"
brew "mas"
brew "stow"

# Browsers
cask "google-chrome"
cask "firefox"

# Communication
cask "slack"
cask "zoom"
mas "WhatsApp", id: 310633997

# Design
cask "figma"
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161

# Developer
brew "cmake"
brew "fish"
brew "git"
brew "maestro"
brew "mise"
brew "ninja"
brew "openssh"
brew "ranger"
brew "ruby-build"
brew "watchman"
cask "android-studio"
cask "bruno"
cask "beekeeper-studio"
cask "docker"
cask "flipper"
cask "graphql-playground"
cask "hyper"
cask "visual-studio-code"
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fauna.fauna"
vscode "flowtype.flow-for-vscode"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "redhat.java"
vscode "shopify.ruby-lsp"
vscode "skyapps.fish-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vscjava.vscode-gradle"
vscode "zobo.php-intellisense"
vscode "zxh404.vscode-proto3"

# Entertainment
cask "spotify"
cask "steam"

# Photo & Video
mas "iMovie", id: 408981434

# Productivity
cask "1password"
cask "notion"
cask "obsidian"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Utilities
brew "imagemagick"
cask "swish"
mas "NordVPN", id: 905953485

# Safari Extensions
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Are.na for Safari", id: 1497800947
mas "Consent-O-Matic", id: 1606897889
