# Dependencies
tap "homebrew/bundle"
tap "oven-sh/bun"
brew "mas"
brew "stow"

# Browsers
cask "google-chrome"
cask "firefox"

# Communication
cask "slack"
cask "zoom"

# Design
cask "figma"
mas "Affinity Photo", id: 824183456
mas "Affinity Designer", id: 824171161

# Developer
brew "bun"
brew "deno"
brew "fish"
brew "fnm"
brew "git"
brew "openssh"
brew "ranger"
brew "rbenv"
brew "ruby-build"
brew "watchman"
cask "android-studio"
cask "flipper"
cask "graphql-playground"
cask "hyper"
cask "postman"
cask "visual-studio-code"
mas "Sequel Ace", id: 1518036000
mas "Xcode", id: 497799835

# Entertainment
cask "spotify"
cask "steam"

# Productivity
cask "1password"
cask "notion"
cask "obsidian"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Utilities
brew "imagemagick"
cask "swish"
mas "NordVPN", id: 905953485

# Safari Extensions
mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Are.na for Safari", id: 1497800947
mas "Consent-O-Matic", id: 1606897889
